cases/annulus/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

probeLocations
(
    // Radial line at mid-length (x=0.025), θ=0, from Ri to Ro
    (0.025 0.000000 0.008002998)
    (0.025 0.000000 0.008127670)
    (0.025 0.000000 0.008252342)
    (0.025 0.000000 0.008377015)
    (0.025 0.000000 0.008501687)
    (0.025 0.000000 0.008626359)
    (0.025 0.000000 0.008751031)
    (0.025 0.000000 0.008875703)
    (0.025 0.000000 0.009000376)
    (0.025 0.000000 0.009125048)
    (0.025 0.000000 0.009249720)
    (0.025 0.000000 0.009374392)
    (0.025 0.000000 0.009499064)
    (0.025 0.000000 0.009623737)
    (0.025 0.000000 0.009748409)
    (0.025 0.000000 0.009873081)
    (0.025 0.000000 0.009997753)
);

fields      ( U p );
