cases/annulus/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat   raw;

sets
(
    radialLine
    {
        type        uniform;
        axis        xyz;
        start       (0.025 0 0.008002998);
        end         (0.025 0 0.009997753);
        nPoints     80;
    }
);

fields      ( U p );

// ************************************************************************* //
